src/Catalogs/КлассификаторОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторОрганизацийЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизацииТС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сопоставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаходитсяВСельскойМестности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыОбменаЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Внутренние значения полей адреса (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУНП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДокументовЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПостановкиНаБалансВРегистр3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктТТНРасхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСписанияИзРегистра3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзРегистра2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияАктаСписания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросДанныхОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОстатковВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСправки1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСправки2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОФорматеОбмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияПроведенЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияПолученЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросДанныхОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОстатковВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОстатковВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхожденийОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРегистр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияАктаРасхожденийПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииДвиженияТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаДвиженияМеждуРегистрами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаДвиженияПоСправке2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаИнформацияОбОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаНеобработанныеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОбработанныеЧеки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаОстаткиВРегистре3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаДвиженияПоСправке2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаНеобработанныеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОбработанныеЧеки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаОстаткиВРегистре3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросСправки1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросСправки2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекККМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтчетаИсторияСправок2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросОтчетаИсторияСправок2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсторияСправок2ПоТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекККМОтменаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияТранспортнойНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияВходящейТранспортнойНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПроизводствеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПроизводствеПереработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПроизводствеСырья</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОтчетаОПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПланируемомИмпорте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияУведомленияОПланируемомИмпорте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОбИмпорте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОтчетаОбИмпорте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОРегистрацииДвиженияОтчетаОбИмпортеПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АСИиУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВскрытиеПотребительскойУпаковки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизацийЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредпринимательРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрагентТаможенногоСоюза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИностранныйКонтрагент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КлассификаторОрганизацийЕГАИС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	РежимОтладки = ОбщегоНазначения.РежимОтладки();
	
	Элементы.Код.ТолькоПросмотр                        = Не РежимОтладки;
	Элементы.ТипОрганизации.ТолькоПросмотр             = Не РежимОтладки;
	Элементы.ТипОрганизации.ТолькоПросмотр             = Не РежимОтладки;
	Элементы.ИНН.ТолькоПросмотр                        = Не РежимОтладки;
	Элементы.КПП.ТолькоПросмотр                        = Не РежимОтладки;
	Элементы.НаименованиеПолное.ТолькоПросмотр         = Не РежимОтладки;
	Элементы.ИдентификаторОрганизацииТС.ТолькоПросмотр = Не РежимОтладки;
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ОбщегоНазначенияЕГАИСКлиент.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		МодульСобытияФормИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСКлиентПереопределяемый");
		МодульСобытияФормИСКлиентПереопределяемый.ОбработкаВыбораКонтрагента(
			Новый ОписаниеОповещения("ПриВыбореКонтрагента", ЭтотОбъект), ВыбранноеЗначение, ИсточникВыбора);
	
		МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОбработкаВыбораТорговогоОбъекта(
			Новый ОписаниеОповещения("ПриВыбореТорговогоОбъекта", ЭтотОбъект), ВыбранноеЗначение, ИсточникВыбора);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ОбщегоНазначенияЕГАИСКлиент.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульСобытияФормИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый");
		МодульСобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияЕГАИСКлиент.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		МодульСобытияФормИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСКлиентПереопределяемый");
		МодульСобытияФормИСКлиентПереопределяемый.ОбработкаВыбораКонтрагента(
			Новый ОписаниеОповещения("ПриВыбореКонтрагента", ЭтотОбъект), НовыйОбъект, Источник);
	
		МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОбработкаВыбораТорговогоОбъекта(
			Новый ОписаниеОповещения("ПриВыбореТорговогоОбъекта", ЭтотОбъект), НовыйОбъект, Источник);
			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбщегоНазначенияСобытияФормИСКлиентПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_КлассификаторОрганизацийЕГАИС", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если (ЗначениеЗаполнено(Объект.Контрагент) Или ЗначениеЗаполнено(Объект.ТорговыйОбъект))
		И Объект.СоответствуетОрганизации Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КлассификаторОрганизацийЕГАИС.Ссылка         КАК Ссылка,
		|	КлассификаторОрганизацийЕГАИС.Контрагент     КАК Контрагент,
		|	КлассификаторОрганизацийЕГАИС.ТорговыйОбъект КАК ТорговыйОбъект
		|ИЗ
		|	Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
		|ГДЕ
		|	КлассификаторОрганизацийЕГАИС.Ссылка <> &Ссылка
		|	И КлассификаторОрганизацийЕГАИС.ТорговыйОбъект = &ТорговыйОбъект
		|	И КлассификаторОрганизацийЕГАИС.Контрагент = &Контрагент
		|");
		
		Запрос.УстановитьПараметр("Ссылка",         Объект.Ссылка);
		Запрос.УстановитьПараметр("ТорговыйОбъект", Объект.ТорговыйОбъект);
		Запрос.УстановитьПараметр("Контрагент",     Объект.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ТекстСообщения = НСтр("ru = 'Организация ""%2"" и торговый объект ""%3"" уже сопоставлены с организацией ЕГАИС ""%1""'");
			
			ТекстСообщения = СтрШаблон(
				ТекстСообщения,
				Выборка.Ссылка, Выборка.Контрагент, Выборка.ТорговыйОбъект);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,,
				"Контрагент", "Объект");
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КодСтраны) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Адрес""'");
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,,
			"ПредставлениеАдреса", "Объект");
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СопоставитьПоИННКПП(Команда)
	
	ОчиститьСообщения();
	
	КонтрагентНайден = СопоставитьПоИННКППСервер();
	
	Если Не КонтрагентНайден Тогда
		Если ЕстьПравоСозданияКонтрагента Тогда
			ПоказатьВопрос(
				Новый ОписаниеОповещения("ПодтвердитьСоздатьНовогоКонтрагента", ЭтотОбъект),
				НСтр("ru='Контрагент с указанными ИНН и КПП не найден. Создать нового?'"),
				РежимДиалогаВопрос.ДаНет);
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Контрагент с указанными ИНН и КПП не найден.'"),,
			                                                  "ИНН",
			                                                  "Объект");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьАлкогольнуюПродукцию(Команда)
	
	ОчиститьСообщения();
	
	Если ПустаяСтрока(Объект.ИНН) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен ИНН организации'"),, "Объект.ИНН");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция",          ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросАлкогольнойПродукции"));
	ПараметрыФормы.Вставить("ИмяПараметра",      "ИНН");
	ПараметрыФормы.Вставить("ЗначениеПараметра", Объект.ИНН);
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьОрганизациюПоКодуФСРАР(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция",         ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросДанныхОрганизации"));
	ПараметрыФормы.Вставить("ИмяПараметра",     "СИО");
	ПараметрыФормы.Вставить("ЗначениеПараметра", Объект.Код);
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИнформациюОбИспользуемомФорматеОбмена(Команда)
	
	ОчиститьСообщения();
	
	ФорматОбмена = ОбменДаннымиЕГАИСКлиентСервер.ФорматОбмена(Объект.ФорматОбмена);
	
	ИдетОбменСЕГАИС = ПараметрыПриложения["ЕГАИС.ДанныеСеансаОбмена"];
	Если ИдетОбменСЕГАИС <> Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выполняется обмен с УТМ. Выгрузите информацию позже.'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеВыгрузкиИнформацииОбИспользуемомФорматеОбмена", ЭтотОбъект);
	ДанныеДляВыполненияОбменаНаКлиенте = ОбменДаннымиЕГАИСВызовСервера.ПодготовитьИнформациюОФорматеОбменаКПередаче(
		Объект.Ссылка, ФорматОбмена, УникальныйИдентификатор);
	ДанныеДляВыполненияОбменаНаКлиенте.Вставить("ВОсновнойФорме");
	ОбменДаннымиЕГАИССлужебныйКлиент.ОбработатьОчередьПередачиДанных(ОповещениеПриЗавершении, ДанныеДляВыполненияОбменаНаКлиенте);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	Если ОбщегоНазначенияЕГАИСКлиент.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульСобытияФормИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормИСКлиентПереопределяемый");
		МодульСобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ПриИзмененииИНН(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННИППриИзменении(Элемент)
	
	ПриИзмененииИНН(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	ТекстСообщения = "";
	Если Не ПустаяСтрока(Объект.КПП)
		И Не РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(Объект.КПП, ТекстСообщения) Тогда
		
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения,,
			"КПП");
			
	КонецЕсли;
	
	СоответствуетОрганизацииПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствуетОрганизацииПриИзменении(Элемент)
	
	Объект.СоответствуетОрганизации = Булево(СоответствуетОрганизации);
	Если Объект.СоответствуетОрганизации Тогда
		Объект.Контрагент = СобственнаяОрганизацияЗначениеПоУмолчанию;
		Объект.ТорговыйОбъект = СобственныйТорговыйОбъектЗначениеПоУмолчанию;
	Иначе
		Объект.Контрагент = СторонняяОрганизацияЗначениеПоУмолчанию;
		Объект.ТорговыйОбъект = СтороннийТорговыйОбъектЗначениеПоУмолчанию;
	КонецЕсли;
	
	СоответствуетОрганизацииПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаСопоставленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговыйОбъектПриИзменении(Элемент)
	
	ПриИзмененииРеквизитаСопоставленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннийТорговыйОбъектПриИзменении(Элемент)
	
	СтороннийТорговыйОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ИНН",                     Объект.ИНН);
	Реквизиты.Вставить("КПП",                     Объект.КПП);
	Реквизиты.Вставить("Наименование",            Объект.НаименованиеПолное);
	Реквизиты.Вставить("СокращенноеНаименование", Объект.Наименование);
	Реквизиты.Вставить("ТорговыйОбъект",          Объект.ТорговыйОбъект);
	
	МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
	Если МодульСобытияФормЕГАИСКлиентПереопределяемый <> Неопределено Тогда
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОткрытьФормуВыбораКонтрагента(
			ЭтотОбъект,
			Реквизиты,
			Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СоздатьНовогоКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннийТорговыйОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ИНН",                     Объект.ИНН);
	Реквизиты.Вставить("КПП",                     Объект.КПП);
	Реквизиты.Вставить("Наименование",            Объект.НаименованиеПолное);
	Реквизиты.Вставить("СокращенноеНаименование", Объект.Наименование);
	
	МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
	Если МодульСобытияФормЕГАИСКлиентПереопределяемый <> Неопределено Тогда
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОткрытьФормуВыбораТорговогоОбъекта(
			ЭтотОбъект,
			Реквизиты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннийТорговыйОбъектСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ИНН",                     Объект.ИНН);
	Реквизиты.Вставить("КПП",                     Объект.КПП);
	Реквизиты.Вставить("Наименование",            Объект.НаименованиеПолное);
	Реквизиты.Вставить("СокращенноеНаименование", Объект.Наименование);
	
	МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
	Если МодульСобытияФормЕГАИСКлиентПереопределяемый <> Неопределено Тогда
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОткрытьФормуСозданияТорговогоОбъекта(
			ЭтотОбъект,
			Реквизиты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматОбменаПриИзменении(Элемент)
	
	ОбновитьИнформациюОВыгруженномФорматеОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаПриИзменении(Элемент)
	
	Текст = Элемент.ТекстРедактирования;
	Если ПустаяСтрока(Текст) Тогда
		// Очистка данных, сбрасываем как представления, так и внутренние значения полей.
		Объект.ПредставлениеАдреса = "";
		Объект.ПочтовыйИндекс      = 0;
		Объект.КодРегиона          = 0;
		Объект.КодСтраны           = 0;
		КомментарийАдреса          = "";
		Объект.Адрес               = "";
		Возврат;
	КонецЕсли;
	
	// Формируем внутренние значения полей по тексту и параметрам формирования из
	// реквизита ВидКонтактнойИнформацииАдреса.
	Объект.ПредставлениеАдреса = Текст;
	
	Объект.Адрес = ЗначенияПолейКонтактнойИнформацииСервер(Текст, ВидКонтактнойИнформацииАдреса, КомментарийАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Если представление было изменено в поле и сразу нажата кнопка выбора, то необходимо 
	// привести данные в соответствие и сбросить внутренние поля для повторного разбора.
	Если Элемент.ТекстРедактирования <> Объект.ПредставлениеАдреса Тогда
		Объект.ПредставлениеАдреса = Элемент.ТекстРедактирования;
		Объект.Адрес               = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Адрес) Тогда
		
		АдресXML = Объект.Адрес;
		
	Иначе
		
		Данные = Новый Структура;
		Данные.Вставить("КодСтраны",     Объект.КодСтраны);
		Данные.Вставить("КодРегиона",    Объект.КодРегиона);
		Данные.Вставить("Индекс",        Объект.ПочтовыйИндекс);
		Данные.Вставить("Представление", Объект.ПредставлениеАдреса);
		
		АдресXML = АдресXML(Данные);
		
	КонецЕсли;
	
	// Данные для редактирования
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ВидКонтактнойИнформацииАдреса);
	ПараметрыОткрытия.Вставить("ЗначенияПолей",           АдресXML);
	ПараметрыОткрытия.Вставить("Представление",           Объект.ПредставлениеАдреса);
	ПараметрыОткрытия.Вставить("Комментарий",             КомментарийАдреса);
	
	// Переопределямый заголовок формы, по умолчанию отобразятся данные по ВидКонтактнойИнформации.
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru='Адрес'"));
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаОчистка(Элемент, СтандартнаяОбработка)
	// Сбрасываем как представления, так и внутренние значения полей.
	Объект.ПредставлениеАдреса = "";
	Объект.ПочтовыйИндекс      = 0;
	Объект.КодРегиона          = 0;
	Объект.КодСтраны           = 0;
	КомментарийАдреса          = "";
	Объект.Адрес               = "";
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение)<>Тип("Структура") Тогда
		// Отказ от выбора, данные неизменны.
		Возврат;
	КонецЕсли;
	
	АдресВФорматеКЛАДР = АдресВФорматеКЛАДР(ВыбранноеЗначение.КонтактнаяИнформация);
	
	Если АдресВФорматеКЛАДР.Свойство("КодРегиона")
		И ЗначениеЗаполнено(АдресВФорматеКЛАДР.КодРегиона) Тогда
		Объект.КодРегиона = Число(АдресВФорматеКЛАДР.КодРегиона);
	Иначе
		Объект.КодРегиона = Неопределено;
	КонецЕсли;
	
	Если АдресВФорматеКЛАДР.Свойство("КодСтраны")
		И ЗначениеЗаполнено(АдресВФорматеКЛАДР.КодСтраны) Тогда
		Объект.КодСтраны = Число(АдресВФорматеКЛАДР.КодСтраны);
	Иначе
		Объект.КодСтраны = Неопределено;
	КонецЕсли;
	
	Если АдресВФорматеКЛАДР.Свойство("Индекс")
		И ЗначениеЗаполнено(АдресВФорматеКЛАДР.Индекс) Тогда
		Объект.ПочтовыйИндекс = Число(АдресВФорматеКЛАДР.Индекс);
	Иначе
		Объект.ПочтовыйИндекс = Неопределено;
	КонецЕсли;
	
	Объект.Адрес = ВыбранноеЗначение.КонтактнаяИнформация;
	
	Объект.ПредставлениеАдреса = ВыбранноеЗначение.Представление;
	КомментарийАдреса          = ВыбранноеЗначение.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийАдресаПриИзменении(Элемент)
	ЗаполнитьКомментарийАдресаСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПредставлениеАдреса.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПредставлениеАдреса");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресXML(Данные)
	
	СтруктураАдреса = Новый Структура;
	
	Если ЗначениеЗаполнено(Данные.КодСтраны) Тогда
		СтруктураАдреса.Вставить("КодСтраны", Формат(Данные.КодСтраны, "ЧГ=0"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.КодСтраны) Тогда
		СтруктураАдреса.Вставить("КодРегиона", Формат(Данные.КодРегиона, "ЧГ=0"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.КодСтраны) Тогда
		СтруктураАдреса.Вставить("Индекс", Формат(Данные.Индекс, "ЧГ=0"));
	КонецЕсли;
	
	СтруктураАдреса.Вставить("Представление", Данные.Представление);
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураАдреса, Данные.Представление, Перечисления.ТипыКонтактнойИнформации.Адрес);
	
КонецФункции

&НаСервере
Процедура ИнициализироватьПоляКонтактнойИнформации()
	
	// Реквизит формы, контролирующий работу с адресом.
	// Используемые поля аналогичны полям справочника ВидыКонтактнойИнформации.
	ВидКонтактнойИнформацииАдреса = Новый Структура;
	ВидКонтактнойИнформацииАдреса.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	ВидКонтактнойИнформацииАдреса.Вставить("АдресТолькоРоссийский",        Ложь);
	ВидКонтактнойИнформацииАдреса.Вставить("ВключатьСтрануВПредставление", Ложь);
	ВидКонтактнойИнформацииАдреса.Вставить("СкрыватьНеактуальныеАдреса",   Ложь);
	
	// Считываем данные из полей адреса в реквизиты для редактирования.
	КомментарийАдреса = ОбщегоНазначенияИС.КомментарийКонтактнойИнформации(Объект.Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомментарийАдресаСервер()
	
	Если ПустаяСтрока(Объект.Адрес) Тогда
		// Необходимо инициализировать данные.
		Объект.Адрес = ЗначенияПолейКонтактнойИнформацииСервер(Объект.ПредставлениеАдреса, ВидКонтактнойИнформацииАдреса, КомментарийАдреса);
		Возврат;
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.УстановитьКомментарийКонтактнойИнформации(Объект.Адрес, КомментарийАдреса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияПолейКонтактнойИнформацииСервер(Знач Представление, Знач ВидКонтактнойИнформации, Знач Комментарий = Неопределено)
	
	// Создаем новый экземпляр по представлению.
	Результат = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Представление, ВидКонтактнойИнформации);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоответствуетОрганизацииПриИзмененииСервер()
	
	Объект.СоответствуетОрганизации = Булево(СоответствуетОрганизации);
	
	Элементы.ГруппаСобственнаяОрганизация.Видимость = Объект.СоответствуетОрганизации;
	Элементы.ГруппаСторонняяОрганизация.Видимость = НЕ Объект.СоответствуетОрганизации;
	
	ПриИзмененииРеквизитаСопоставленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СтороннийТорговыйОбъектПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТорговыйОбъект) Тогда
		Объект.Контрагент = ОбщегоНазначенияЕГАИСВызовСервера.КонтрагентТорговогоОбъекта(Объект.ТорговыйОбъект);
	Иначе
		Объект.Контрагент = СторонняяОрганизацияЗначениеПоУмолчанию;
	КонецЕсли;
	
	ПриИзмененииРеквизитаСопоставленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		РаботаСКонтрагентамиЕГАИСПереопределяемый.ТорговыйОбъектКонтрагента(Объект.ТорговыйОбъект, Объект.Контрагент);
	КонецЕсли;
	
	ПриИзмененииРеквизитаСопоставленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИНН(ЭтоЮрЛицо)
	
	ТекстСообщения = "";
	Если Не ПустаяСтрока(Объект.ИНН)
		И Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, ЭтоЮрЛицо, ТекстСообщения) Тогда
		
		ОчиститьСообщения();
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения,,
			"Объект.ИНН");
		
	КонецЕсли;
	
	СоответствуетОрганизацииПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСопоставлено()
	
	Объект.Сопоставлено = Справочники.КлассификаторОрганизацийЕГАИС.РассчитатьСопоставлено(
		Объект.ТорговыйОбъект,
		Объект.Контрагент,
		Объект.СоответствуетОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СопоставитьПоИННКПП.Доступность = (ЗначениеЗаполнено(Объект.ИНН) И Не Объект.Сопоставлено);
	Элементы.СопоставитьПоИНН.Доступность    = (ЗначениеЗаполнено(Объект.ИНН) И Не Объект.Сопоставлено);
	
	Элементы.ГруппаЮЛ.Видимость = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизацийЕГАИС.ЮридическоеЛицоРФ")
	                              ИЛИ Объект.ТипОрганизации.Пустая());
	
	Элементы.ГруппаИП.Видимость = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизацийЕГАИС.ИндивидуальныйПредпринимательРФ"));
	Элементы.ГруппаТС.Видимость = (Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизацийЕГАИС.КонтрагентТаможенногоСоюза"));
	
	Элементы.ВыгрузитьИнформациюОбИспользуемомФорматеОбмена.Видимость = СоответствуетОрганизации;
	Элементы.ИнформацияОВыгруженномФорматеОбмена.Видимость            = СоответствуетОрганизации;
	
	Элементы.ЗапроситьАлкогольнуюПродукцию.Видимость =
		Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизацийЕГАИС.ЮридическоеЛицоРФ")
		ИЛИ Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизацийЕГАИС.ИндивидуальныйПредпринимательРФ");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСопоставления()
	
	ДанныеСопоставления = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Контрагент)
		И ПравоДоступа("Чтение", Объект.Контрагент.Метаданные()) Тогда
		
		ДанныеСопоставления = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Объект.Контрагент, Объект.ТорговыйОбъект);
		
	КонецЕсли;
	
	Если ДанныеСопоставления <> Неопределено Тогда
		
		ИНН = ДанныеСопоставления.ИНН;
		КПП = ДанныеСопоставления.КПП;
		
		Элементы.ИННОрганизацииНеСоответствуетОрганизацииЕГАИС.Видимость = (ДанныеСопоставления.ИНН <> Объект.ИНН И Объект.СоответствуетОрганизации);
		Элементы.КППОрганизацииНеСоответствуетОрганизацииЕГАИС.Видимость = (ДанныеСопоставления.КПП <> Объект.КПП И Объект.СоответствуетОрганизации);
		Элементы.ИННКонтрагентаНеСоответствуетОрганизацииЕГАИС.Видимость = (ДанныеСопоставления.ИНН <> Объект.ИНН И НЕ Объект.СоответствуетОрганизации);
		Элементы.КППКонтрагентаНеСоответствуетОрганизацииЕГАИС.Видимость = (ДанныеСопоставления.КПП <> Объект.КПП И НЕ Объект.СоответствуетОрганизации);
		
	Иначе
		
		ИНН = "";
		КПП = "";
		
		Элементы.ИННОрганизацииНеСоответствуетОрганизацииЕГАИС.Видимость = Ложь;
		Элементы.КППОрганизацииНеСоответствуетОрганизацииЕГАИС.Видимость = Ложь;
		Элементы.ИННКонтрагентаНеСоответствуетОрганизацииЕГАИС.Видимость = Ложь;
		Элементы.КППКонтрагентаНеСоответствуетОрганизацииЕГАИС.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитаСопоставленияНаСервере()
	
	ЗаполнитьДанныеСопоставления();
	РассчитатьСопоставлено();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	СоответствуетОрганизации = Объект.СоответствуетОрганизации;
	
	СопоставлениеОбъектовЕГАИСПереопределяемый.ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		СобственнаяОрганизацияЗначениеПоУмолчанию,
		СобственныйТорговыйОбъектЗначениеПоУмолчанию,
		СторонняяОрганизацияЗначениеПоУмолчанию,
		СтороннийТорговыйОбъектЗначениеПоУмолчанию);
	
	МассивТиповСобственнаяОрганизация = Новый Массив;
	МассивТиповСобственнаяОрганизация.Добавить(ТипЗнч(СобственнаяОрганизацияЗначениеПоУмолчанию));
	Элементы.Организация.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСобственнаяОрганизация);
	
	МассивТиповСобственныйТорговыйОбъект = Новый Массив;
	МассивТиповСобственныйТорговыйОбъект.Добавить(ТипЗнч(СобственныйТорговыйОбъектЗначениеПоУмолчанию));
	Элементы.ТорговыйОбъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСобственныйТорговыйОбъект);
	
	МассивТиповСторонняяОрганизация = Новый Массив;
	МассивТиповСторонняяОрганизация.Добавить(ТипЗнч(СторонняяОрганизацияЗначениеПоУмолчанию));
	Элементы.Контрагент.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСторонняяОрганизация);
	
	МассивТиповСтороннийТорговыйОбъект = Новый Массив;
	МассивТиповСтороннийТорговыйОбъект.Добавить(ТипЗнч(СтороннийТорговыйОбъектЗначениеПоУмолчанию));
	Элементы.СтороннийТорговыйОбъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТиповСтороннийТорговыйОбъект);
	
	Если СтороннийТорговыйОбъектЗначениеПоУмолчанию = Неопределено Тогда
		Элементы.СтороннийТорговыйОбъект.Видимость = Ложь;
	Иначе
		Элементы.СтороннийТорговыйОбъект.Видимость = РаботаСКонтрагентамиЕГАИС.ИспользоватьТорговыеОбъектыКонтрагентов();
	КонецЕсли;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	ИнициализироватьПоляКонтактнойИнформации();
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Если ОбщегоНазначенияИС.ЭтоРасширеннаяВерсияГосИС("ЕГАИС") Тогда
		ЕстьПравоСозданияКонтрагента = ОбщегоНазначенияИС.ПравоОпределяемогоТипа(Метаданные.ОпределяемыеТипы["КонтрагентГосИС"], "Добавление");
	КонецЕсли;
	
	СоответствуетОрганизацииПриИзмененииСервер();
	
	ЗаполнитьДанныеСопоставления();
	
	Элементы.ФорматОбмена.СписокВыбора.Очистить();
	Элементы.ФорматОбмена.СписокВыбора.Добавить(Перечисления.ФорматыОбменаЕГАИС.V3, НСтр("ru = 'V3 (УТМ 3.0.8)'"));
	Элементы.ФорматОбмена.СписокВыбора.Добавить(Перечисления.ФорматыОбменаЕГАИС.V4, НСтр("ru = 'V4 (УТМ 4.0.2 и выше)'"));
	
	Если ЗначениеЗаполнено(Объект.ФорматОбмена) Тогда
		ЭлементСпискаВыбора = Элементы.ФорматОбмена.СписокВыбора.НайтиПоЗначению(Объект.ФорматОбмена);
		Если ЭлементСпискаВыбора = Неопределено Тогда
			Элементы.ФорматОбмена.СписокВыбора.Добавить(Объект.ФорматОбмена);
		КонецЕсли;
	Иначе
		Объект.ФорматОбмена = Перечисления.ФорматыОбменаЕГАИС.V3;
	КонецЕсли;
	
	ОбновитьИнформациюОВыгруженномФорматеОбмена();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресВФорматеКЛАДР(Данные)
	
	АдресВФорматеКЛАДР = РаботаСАдресами.СведенияОбАдресе(Данные);
	
	Возврат АдресВФорматеКЛАДР;
	
КонецФункции

#Область СопоставлениеПартнеров

&НаСервере
Функция СопоставитьПоИННКППСервер()
	
	Если Объект.СоответствуетОрганизации Тогда
		
		НайденнаяОрганизация = ОбщегоНазначенияИС.ОрганизацияПоИННКПП(Объект.ИНН, Объект.КПП);
		Если ЗначениеЗаполнено(НайденнаяОрганизация) Тогда
			Объект.Контрагент = НайденнаяОрганизация;
		КонецЕсли;
		
		ПриИзмененииРеквизитаСопоставленияНаСервере();
		
		Возврат Истина;
		
	Иначе
		
		РезультатПоиска = Неопределено;
		РаботаСКонтрагентамиЕГАИСПереопределяемый.КонтрагентТорговыйОбъектПоИННКПП(РезультатПоиска, Объект.ИНН, Объект.КПП);
		Если ЗначениеЗаполнено(РезультатПоиска) Тогда
			
			Объект.Контрагент     = РезультатПоиска.Контрагент;
			Объект.ТорговыйОбъект = РезультатПоиска.ТорговыйОбъект;
			
			ПриИзмененииРеквизитаСопоставленияНаСервере();
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПодтвердитьСоздатьНовогоКонтрагента(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		СоздатьНовогоКонтрагента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоКонтрагента()
	
	Если ОбщегоНазначенияЕГАИСКлиент.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		МодульИнтеграцияЕГАИСКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияЕГАИСКлиент");
		ПараметрыСозданияКонтрагента = МодульИнтеграцияЕГАИСКлиент.ПараметрыСозданияКонтрагента();
		ДанныеКонтрагента = МодульИнтеграцияЕГАИСКлиент.ПараметрыСозданияКонтрагента();
		Для Каждого КлючИЗначение Из ПараметрыСозданияКонтрагента Цикл
			ДанныеКонтрагента[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Значение];
		КонецЦикла;
		
		МодульСобытияФормЕГАИСКлиентПереопределяемый = ОбщегоНазначенияКлиент.ОбщийМодуль("СобытияФормЕГАИСКлиентПереопределяемый");
		МодульСобытияФормЕГАИСКлиентПереопределяемый.ОткрытьФормуСозданияКонтрагента(ЭтотОбъект, ДанныеКонтрагента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореКонтрагента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	Объект.Контрагент = ВыбранноеЗначение;
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореТорговогоОбъекта(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	Объект.ТорговыйОбъект = ВыбранноеЗначение;
	
	СтороннийТорговыйОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыгрузкиИнформацииОбИспользуемомФорматеОбмена(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для Каждого ЭлементДанных Из Результат Цикл
			Если ЗначениеЗаполнено(ЭлементДанных.ТекстОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДанных.ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьИнформациюОВыгруженномФорматеОбмена();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОВыгруженномФорматеОбмена()
	
	ФорматОбмена = ОбменДаннымиЕГАИСКлиентСервер.ФорматОбмена(Объект.ФорматОбмена);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕГАИСПрисоединенныеФайлы.ФорматОбмена КАК ФорматОбмена,
	|	ЕГАИСПрисоединенныеФайлы.ДатаМодификацииУниверсальная КАК ДатаМодификацииУниверсальная
	|ИЗ
	|	Справочник.ЕГАИСПрисоединенныеФайлы КАК ЕГАИСПрисоединенныеФайлы
	|ГДЕ
	|	ЕГАИСПрисоединенныеФайлы.Операция = &Операция
	|	И ЕГАИСПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕГАИСПрисоединенныеФайлы.ДатаМодификацииУниверсальная УБЫВ");
	
	Запрос.УстановитьПараметр("Операция",      ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ИнформацияОФорматеОбмена"));
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДатаИзменения = Формат(
			Выборка.ДатаМодификацииУниверсальная, "ДЛФ=DD");
			
		Если Выборка.ФорматОбмена <> ФорматОбмена Тогда
			ЦветТекста = ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС;
			ТекстСообщения = НСтр("ru = 'Требуется выгрузка'");
		Иначе
			ЦветТекста = Новый Цвет;
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Выгружено %1'"),
				ДатаИзменения)
		КонецЕсли;
		
		ИнформацияОВыгруженномФорматеОбмена = Новый ФорматированнаяСтрока(
			ТекстСообщения,,
			ЦветТекста);
		
	Иначе
		
		ИнформацияОВыгруженномФорматеОбмена = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Нет данных о выгрузке'"),,
			ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
